<?php

    class NewsController extends Controller{

         protected $news=
            ['1'=>
                ['title' => 'Українка Еліна Світоліна стала переможницею турніру серії WTA в Дубаї',
                    'description' => 'У фіналі турніру в Дубаї (ОАЕ) перша ракетка України Еліна Світоліна обіграла 24-у ракетку світу росіянку Дар\'ю Касаткину 6:4, 6:0. Про це повідомляє "Укрінформ".
            
                                      Це другий титул українки в цьому сезоні і одинадцятий за кар\'єру. У січні вона виграла турнір в Брісбені.
            
                                      Світоліна збереже четверте місце в рейтингу WTA і підніметься на четверте місце в чемпіонській гонці.
            
                                      Нагадаємо, Еліна Світоліна також виграла турнір в Дубаї в 2017 році.',
                    'datetime' => '24.02.2018 20:49',
                    'link'=>'/news/view/1',
                    'source'=>'5 канал'
                ],
                '2'=>   ['title' =>'МОРОЗИ В УКРАЇНІ: ДЕ БУДЕ НАЙХОЛОДНІШЕ',
                    'description'=>'Мінус 16°C було цієї ночі в Києві, мінус 18°C обіцяють нам синоптики на ніч проти понеділка, але подекуди в країні стовпчик термометра впаде і до 25°C нижче нуля. 
                     Про таке повідомляє "5 канал" з посиланням на Гідрометцентр.',
                    'datetime'=>'25.02.2018 09:01',
                    'link'=>'/news/view/2',
                    'source'=>'5 канал'
                ]
            ];

        public function index(){
           // $this->data['test_content'] = 'Here will be a news list';
            $this->data=$this->news;
//
        }

        public function view(){
            $params = App::getRouter()->getParams();

            if ( isset($params[0]) ){
                $alias = strtolower($params[0]);
             //   $this->data['content'] = "Here will be a page with '{$alias}' alias";
                $this->data['content']=$this->news["{$alias}"];


            }




        }

    }